In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [6]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.809136 -1.446511 -0.663548
1 -1.429207  1.494727  2.873390
2  1.537869 -0.537117  0.142371
3 -0.937908 -0.076416  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

In [21]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.809136       NaN       NaN
1 -1.429207       NaN       NaN
2  1.537869       NaN  0.142371
3 -0.937908       NaN  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

In [22]:
df.dropna()

          0         1         2
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

In [23]:
 df.dropna(thresh=2)

          0         1         2
2  1.537869       NaN  0.142371
3 -0.937908       NaN  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

# Filling In Missing Data

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
df

          0         1         2
0 -0.809136       NaN       NaN
1 -1.429207       NaN       NaN
2  1.537869       NaN  0.142371
3 -0.937908       NaN  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

In [29]:
df.fillna(0)
data.fillna(7)

     0    1    2    4
0  1.0  6.5  3.0  7.0
1  1.0  7.0  7.0  7.0
2  7.0  7.0  7.0  7.0
3  7.0  6.5  3.0  7.0

In [34]:
np.mean(data)

0    1.0
1    6.5
2    3.0
4    NaN
dtype: float64

In [35]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [33]:
data.fillna(np.mean(data))

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  6.5  3.0 NaN
3  1.0  6.5  3.0 NaN

In [32]:
print(df)
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.809136       NaN       NaN
1 -1.429207       NaN       NaN
2  1.537869       NaN  0.142371
3 -0.937908       NaN  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

          0         1         2
0 -0.809136  0.500000  0.000000
1 -1.429207  0.500000  0.000000
2  1.537869  0.500000  0.142371
3 -0.937908  0.500000  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

In [40]:
df.fillna(0, inplace=True)

In [41]:
df

          0         1         2
0 -0.809136  0.000000  0.000000
1 -1.429207  0.000000  0.000000
2  1.537869  0.000000  0.142371
3 -0.937908  0.000000  0.151676
4  0.530056  0.746022  1.027869
5  0.864985  0.017359  1.405626
6  1.367113  0.945874  1.891945

In [42]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.841097  1.342244  1.032784
1 -0.047511 -0.683111 -0.666724
2 -0.251010       NaN -0.550298
3 -0.713455       NaN -1.070477
4  0.169247       NaN       NaN
5 -0.475450       NaN       NaN

In [43]:
df.fillna(method="ffill")

          0         1         2
0  1.841097  1.342244  1.032784
1 -0.047511 -0.683111 -0.666724
2 -0.251010 -0.683111 -0.550298
3 -0.713455 -0.683111 -1.070477
4  0.169247 -0.683111 -1.070477
5 -0.475450 -0.683111 -1.070477

In [44]:
df.fillna(method="ffill", axis=1)

          0         1         2
0  1.841097  1.342244  1.032784
1 -0.047511 -0.683111 -0.666724
2 -0.251010 -0.251010 -0.550298
3 -0.713455 -0.713455 -1.070477
4  0.169247  0.169247  0.169247
5 -0.475450 -0.475450 -0.475450

In [45]:
df

          0         1         2
0  1.841097  1.342244  1.032784
1 -0.047511 -0.683111 -0.666724
2 -0.251010       NaN -0.550298
3 -0.713455       NaN -1.070477
4  0.169247       NaN       NaN
5 -0.475450       NaN       NaN

In [46]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.841097  1.342244  1.032784
1 -0.047511 -0.683111 -0.666724
2 -0.251010 -0.683111 -0.550298
3 -0.713455 -0.683111 -1.070477
4  0.169247       NaN -1.070477
5 -0.475450       NaN -1.070477

In [53]:
print(df)
df.iloc[:,1]

          0         1         2
0  1.841097  1.342244  1.032784
1 -0.047511 -0.683111 -0.666724
2 -0.251010       NaN -0.550298
3 -0.713455       NaN -1.070477
4  0.169247       NaN       NaN
5 -0.475450       NaN       NaN

0    1.342244
1   -0.683111
2         NaN
3         NaN
4         NaN
5         NaN
Name: 1, dtype: float64

In [50]:
data = pd.Series([1., NA, 3.5, NA, 7])
print(data)
data.fillna(data.mean())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [49]:
data.mean()

3.8333333333333335

## 7.2 Data Transformation

In [54]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [56]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [59]:
data[data.duplicated()]
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [61]:
#dropduplicate based on specific column or columns
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

In [62]:
#dropduplicate based on specific column or columns
data.drop_duplicates(subset="k1", keep='last')

    k1  k2
4  one   3
6  two   4

In [63]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

## Transforming Data Using a Function or Mapping

In [64]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [65]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

data['animal'] = data.food.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [70]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [71]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [74]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [75]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [76]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [78]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [79]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [81]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [82]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [83]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [84]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [87]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [88]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [85]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [90]:
pd.cut(ages, [18, 26, 36, 61, 100], right=True)

[(18, 26], (18, 26], (18, 26], (26, 36], (18, 26], ..., (26, 36], (36, 61], (36, 61], (36, 61], (26, 36]]
Length: 12
Categories (4, interval[int64]): [(18, 26] < (26, 36] < (36, 61] < (61, 100]]

In [93]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.043, 0.28], (0.28, 0.52], (0.52, 0.76], (0.76, 0.99], (0.76, 0.99], ..., (0.043, 0.28], (0.043, 0.28], (0.52, 0.76], (0.043, 0.28], (0.28, 0.52]]
Length: 20
Categories (4, interval[float64]): [(0.043, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

In [94]:
pd.cut(data, 4, precision=2).value_counts()

(0.043, 0.28]    7
(0.28, 0.52]     4
(0.52, 0.76]     4
(0.76, 0.99]     5
dtype: int64

In [95]:
data = np.random.randn(1000) 
cats = pd.qcut(data, 4)
cats

[(0.635, 3.102], (-0.0744, 0.635], (-0.799, -0.0744], (0.635, 3.102], (-0.799, -0.0744], ..., (-4.101, -0.799], (-4.101, -0.799], (-0.799, -0.0744], (-0.799, -0.0744], (-4.101, -0.799]]
Length: 1000
Categories (4, interval[float64]): [(-4.101, -0.799] < (-0.799, -0.0744] < (-0.0744, 0.635] < (0.635, 3.102]]

In [96]:
pd.qcut(data, [0, 0.1, .5, .75, 1])

[(0.635, 3.102], (-0.0744, 0.635], (-1.357, -0.0744], (0.635, 3.102], (-1.357, -0.0744], ..., (-4.101, -1.357], (-4.101, -1.357], (-1.357, -0.0744], (-1.357, -0.0744], (-4.101, -1.357]]
Length: 1000
Categories (4, interval[float64]): [(-4.101, -1.357] < (-1.357, -0.0744] < (-0.0744, 0.635] < (0.635, 3.102]]

In [97]:
pd.qcut(data, [0, 0.1, .5, .75, 1]).value_counts()

(-4.101, -1.357]     100
(-1.357, -0.0744]    400
(-0.0744, 0.635]     250
(0.635, 3.102]       250
dtype: int64

# Detecting and Filtering Outliers

In [98]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.055858     0.010167     0.009941    -0.024551
std       1.001587     0.983566     1.036464     0.978211
min      -2.991122    -2.892790    -3.213078    -3.331601
25%      -0.736793    -0.671355    -0.622839    -0.678790
50%      -0.068840    -0.007814     0.016960    -0.014845
75%       0.589097     0.683019     0.648651     0.619065
max       3.098274     3.240285     3.081324     3.163995

In [99]:
col = data[2]
col

0      0.510039
1      0.077448
2     -0.768507
3     -2.584001
4      0.215618
         ...
995    0.243200
996   -0.053730
997    0.392911
998    2.405420
999    1.212366
Name: 2, Length: 1000, dtype: float64

In [100]:
col[np.abs(col) > 3]

671    3.081324
690    3.002923
756   -3.213078
Name: 2, dtype: float64

In [101]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
147 -1.194373  3.240285 -0.599058  1.175295
357  3.098274 -1.004468  0.843481 -0.420475
532 -1.192977  0.273358  0.689363 -3.331601
557  1.467346  0.334384 -1.804800 -3.057877
671  1.304307 -1.304466  3.081324 -1.116481
690 -0.905579  0.179979  3.002923  0.320989
756 -0.163358 -1.058019 -3.213078  0.513428
775 -0.131246 -0.071059  0.259761  3.163995

In [102]:
np.array([True,True,False]).any()

True

In [103]:
np.array([True,True,False]).all()

False

In [104]:
data[np.abs(data) > 3] = np.sign(data) * 3
data

            0         1         2         3
0    0.213470  1.305107  0.510039  0.107341
1   -0.076226 -0.394101  0.077448 -0.629093
2   -1.326719 -0.695962 -0.768507 -1.032607
3    0.315023  0.453730 -2.584001 -0.341718
4    0.716388 -1.691383  0.215618  1.715389
..        ...       ...       ...       ...
995  1.859064 -1.625013  0.243200 -0.349733
996  0.252920  0.805442 -0.053730  0.612831
997  0.022176  0.041650  0.392911  0.402047
998  1.446634 -0.651177  2.405420  1.060035
999 -0.349127 -0.158500  1.212366  0.902513

[1000 rows x 4 columns]

In [105]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0  1.0

# Permutation and Random Sampling

In [106]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [108]:
sampler = np.random.permutation(5)
sampler

array([1, 2, 4, 0, 3])

In [109]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [110]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [113]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=3, replace=False)
draws

3    6
0    5
2   -1
dtype: int64

In [114]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=3, replace=False)
draws

4    4
0    5
2   -1
dtype: int64

# Computing Indicator/Dummy Variables

In [115]:
a = pd.Series(['A','B','C',"A","C","B"])
pd.get_dummies(a)

   A  B  C
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0
4  0  0  1
5  0  1  0